{
  "common": {
    "name": "vis-inventwo",
    "version": "3.3.5",
    "news": {
      "3.3.5": {
        "en": "Radio button cannot write a boolean, Fixed adapter checker error in package.json and io-package.json, Changed mode in io-package from daemon to once",
        "de": "Radio-Taste kann keinen boolean, Fixed Adapter Checker Fehler in Paket schreiben. json und io-package. Json, Geänderter Modus in io-Package von daemon auf einmal",
        "ru": "Радио-кнопка не может написать ошибку проверки фиксированного адаптера в пакете. Джейсон и Айо-пакет. Джейсон, Измененный режим в io-пакете от демона до одного раза",
        "pt": "O botão de rádio não pode escrever um erro de verificador de adaptador booleano e fixo no pacote. json e io-package. Json, Modo alterado em io-package de daemon a uma vez",
        "nl": "Radioknop kan geen booleaanse, vaste adaptercontrolefout in pakket schrijven. Json en io-package. Json, Veranderde modus in io-pakket van daemon naar eenmaal",
        "fr": "Le bouton radio ne peut pas écrire une erreur booléenne, correcteur d'adaptateur dans le paquet. Json et io-package. Json, Mode modifié en io-package de démon à une fois",
        "it": "Pulsante radio non può scrivere un errore booleano, adattatore fisso checker in pacchetto. json e io-package. json... Modalità modificata in io-package da demone a una volta",
        "es": "El botón de radio no puede escribir un error booleano, corrector de adaptador en paquete. json y io-package. Json, Modo cambiado en io-paquete de daemon a una vez",
        "pl": "Przycisk radiowy nie może zapisać błędu kontrolera łącznika w pakiecie. Json i jo- paczka. Josh, Zmieniono tryb w pakiecie jo- z demona na jeden raz",
        "uk": "Кнопка радіо не може писати boolean, виправлена помилка перевірки адаптера в пакеті. json і io-package. джсон, Змінений режим в io-package від daemon до одного разу",
        "zh-cn": "无线电按钮不能在软件包中写入布尔, 固定适配器检查器错误 。 json和io包装。 强森, 将 io- package 模式从守护进程更改为一次"
      },
      "3.3.4": {
        "en": "Fixed: Color picker widget disappears when selecting CIE.\nFixed: Simple Slider color of steps cannot be changed.\nFixed: Image Widget always shows the image for true.\nFixed: Radio button - image color true is taken from false.\nFixed: Double trigger button/state and \"slider cannot be slid\" with Windows Touch.\nFixed: json table with \"Binding\" does not work in the editor.\nFixed: JSON Table Widget: Color change of the values via threshold is only visible in the editor, not in runtime.",
        "de": "Behoben: Color-Picker-Widget verschwindet bei Auswahl von CIE.\nBehoben: Simple Slider Farbe der Schritte nicht änderbar.\nBehoben: Image Widget zeigt immer das Image für true.\nBehoben: Radiobutton - Bildfarbe true wird von false übernommen.\nBehoben: Doppelauslösung Taster/state und \"slider lässt sich nicht \"sliden bei Windows Touch.\nBehoben: json Tabelle mit \"Binding\" funktioniert im Editor nicht.\nBehoben: JSON Table Widget: Farbänderung der Werte via Schwellwert ist nur im Editor, nicht in Runtime sichtbar.",
        "ru": "Исправлено: виджет выбора цвета «исчезает» при выборе CIE.\nИсправлено: цвет шагов простого ползунка нельзя изменить.\nИсправлено: виджет изображения всегда показывает истинное изображение.\nИсправлено: Переключатель - цвет изображения true берется из false.\nИсправлено: двойная кнопка/состояние триггера и «ползунок не может быть перемещен» с помощью Windows Touch.\nИсправлено: таблица json с «Привязкой» не работает в редакторе.\nИсправлено: Виджет таблицы JSON: изменение цвета значений через пороговое значение видно только в редакторе, а не во время выполнения.",
        "pt": "Corrigido: o widget seletor de cores “desaparece” ao selecionar CIE.\nCorrigido: a cor das etapas do controle deslizante simples não pode ser alterada.\nCorrigido: o widget de imagem sempre mostra a imagem verdadeira.\nCorrigido: botão de opção - a cor verdadeira da imagem é retirada de falsa.\nCorrigido: botão/estado de disparo duplo e \"controle deslizante não pode ser deslizado\" com o Windows Touch.\nCorrigido: tabela json com “Binding” não funciona no editor.\nCorrigido: widget de tabela JSON: a mudança de cor dos valores por meio do limite só é visível no editor, não em tempo de execução.",
        "nl": "Opgelost: de kleurkiezerwidget \"verdwijnt\" bij het selecteren van CIE.\nOpgelost: De kleur van de eenvoudige schuifregelaar van stappen kan niet worden gewijzigd.\nOpgelost: Afbeeldingswidget toont de afbeelding altijd als waar.\nOpgelost: keuzerondje - de kleur van de afbeelding waar is overgenomen van onwaar.\nOpgelost: dubbele triggerknop/status en \"schuifregelaar kan niet worden verschoven\" met Windows Touch.\nOpgelost: json-tabel met \"Binding\" werkt niet in de editor.\nOpgelost: JSON Table Widget: Kleurverandering van de waarden via drempelwaarde is alleen zichtbaar in de editor, niet tijdens runtime.",
        "fr": "Corrigé : le widget de sélection de couleurs \"disparaît\" lors de la sélection de CIE.\nCorrigé : la couleur du curseur simple des étapes ne peut pas être modifiée.\nCorrigé : Image Widget affiche toujours l'image vraie.\nCorrigé : bouton radio - la couleur de l'image vraie est prise à partir de fausse.\nCorrigé : Double bouton/état de déclenchement et « le curseur ne peut pas être glissé » avec Windows Touch.\nCorrigé : la table json avec \"Binding\" ne fonctionne pas dans l'éditeur.\nCorrigé : Widget de table JSON : le changement de couleur des valeurs via le seuil n'est visible que dans l'éditeur, pas au moment de l'exécution.",
        "it": "Risolto: il widget di selezione colore \"scompare\" quando si seleziona CIE.\nRisolto: il colore dei passaggi del cursore semplice non può essere modificato.\nRisolto: il widget immagine mostra sempre l'immagine come vera.\nRisolto: pulsante di opzione: il colore dell'immagine vero è preso da falso.\nRisolto: doppio pulsante/stato di attivazione e \"il cursore non può essere fatto scorrere\" con Windows Touch.\nRisolto: la tabella json con \"Binding\" non funziona nell'editor.\nRisolto: widget tabella JSON: il cambiamento di colore dei valori tramite soglia è visibile solo nell'editor, non in runtime.",
        "es": "Corregido: el widget de selección de color \"desaparece\" al seleccionar CIE.\nCorregido: el color del control deslizante simple de los pasos no se puede cambiar.\nCorregido: el widget de imagen siempre muestra la imagen verdadera.\nCorregido: botón de opción: el color de la imagen verdadero se toma de falso.\nCorregido: botón/estado de doble disparo y \"el control deslizante no se puede deslizar\" con Windows Touch.\nCorregido: la tabla json con \"Binding\" no funciona en el editor.\nCorregido: Widget de tabla JSON: el cambio de color de los valores a través del umbral solo es visible en el editor, no en tiempo de ejecución.",
        "pl": "Naprawiono: Widżet selektora kolorów „znika” po wybraniu CIE.\nNaprawiono: Nie można zmienić koloru kroków prostego suwaka.\nNaprawiono: Widżet obrazu zawsze pokazuje obraz jako prawdziwy.\nNaprawiono: Przycisk opcji – prawdziwy kolor obrazu jest pobierany z fałszywego.\nNaprawiono: Podwójny przycisk/stan spustu i „nie można przesuwać suwaka” w systemie Windows Touch.\nNaprawiono: tabela json z „Wiązaniem” nie działa w edytorze.\nNaprawiono: Widżet tabeli JSON: Zmiana koloru wartości poprzez próg jest widoczna tylko w edytorze, a nie w czasie wykonywania.",
        "uk": "Виправлено: віджет вибору кольору «зникає» під час вибору CIE.\nВиправлено: колір східців простого повзунка не можна було змінити.\nВиправлено: віджет зображення завжди показує зображення як істинне.\nВиправлено: радіокнопка - колір зображення true береться з false.\nВиправлено: подвійна тригерна кнопка/стан і «повзунок неможливо пересунути» за допомогою Windows Touch.\nВиправлено: таблиця json з «Прив'язкою» не працює в редакторі.\nВиправлено: Віджет таблиці JSON: зміна кольору значень через порогове значення видно лише в редакторі, а не під час виконання.",
        "zh-cn": "已修复：选择 CIE 时颜色选择器小部件“消失”。\n修复：无法更改步骤的简单滑块颜色。\n修复：图像小部件始终显示真实的图像。\n修正：单选按钮 - 图像颜色 true 取自 false。\n修复：Windows Touch 下双触发按钮/状态和“滑块无法滑动”。\n修复：带有“Binding”的 json 表在编辑器中不起作用。\n已修复：JSON 表小部件：通过阈值更改值的颜色仅在编辑器中可见，在运行时不可见。"
      },
      "3.3.3": {
        "en": "Fixed issue with border color and view in popup",
        "de": "Problem mit Randfarbe und Ansicht im Popup behoben",
        "ru": "Исправлена проблема с цветом границы и видом во всплывающем окне.",
        "pt": "Corrigido problema com a cor da borda e visualização em pop-up",
        "nl": "Probleem opgelost met randkleur en weergave in pop-up",
        "fr": "Correction d'un problème avec la couleur de la bordure et la vue dans la fenêtre contextuelle",
        "it": "Risolto il problema con il colore del bordo e la visualizzazione nel popup",
        "es": "Se solucionó el problema con el color del borde y la vista en la ventana emergente",
        "pl": "Naprawiono problem z kolorem obramowania i widokiem w wyskakującym okienku",
        "uk": "Виправлено проблему з кольором рамки та виглядом у спливаючому вікні",
        "zh-cn": "修复了弹出窗口中边框颜色和视图的问题"
      },
      "3.3.1": {
        "en": "Bugfix",
        "de": "Fehlerbehebung",
        "ru": "Исправлена ошибка",
        "pt": "Bugfix",
        "nl": "Bugfix",
        "fr": "Correction d'un bug",
        "it": "Risoluzione del problema",
        "es": "Arreglo del fallo",
        "pl": "Naprawa błędów",
        "uk": "Виправлення помилок",
        "zh-cn": "错误修正"
      },
      "3.3.0": {
        "en": "New widget: configurable colorpicker for HEX, RGB, HSL, HSV and CIE/XY",
        "de": "Neues Widget: Konfigurierbarer Colorpicker für HEX, RGB, HSL, HSV und CIE/XY",
        "ru": "Новый виджет: настраиваемый инструмент выбора цвета для HEX, RGB, HSL, HSV и CIE/XY.",
        "pt": "Novo widget: seletor de cores configurável para HEX, RGB, HSL, HSV e CIE/XY",
        "nl": "Nieuwe widget: configureerbare kleurenkiezer voor HEX, RGB, HSL, HSV en CIE/XY",
        "fr": "Nouveau widget : sélecteur de couleurs configurable pour HEX, RVB, HSL, HSV et CIE/XY",
        "it": "Nuovo widget: selettore colore configurabile per HEX, RGB, HSL, HSV e CIE/XY",
        "es": "Nuevo widget: selector de color configurable para HEX, RGB, HSL, HSV y CIE/XY",
        "pl": "Nowy widżet: konfigurowalny selektor kolorów dla HEX, RGB, HSL, HSV i CIE/XY",
        "uk": "Новий віджет: настроюваний вибір кольорів для HEX, RGB, HSL, HSV і CIE/XY",
        "zh-cn": "新小部件：用于 HEX、RGB、HSL、HSV 和 CIE/XY 的可配置颜色选择器"
      }
    },
    "titleLang": {
      "en": "inventwo Design Widgets",
      "de": "inventwo Design Widgets",
      "ru": "Изобретательские Виджеты Дизайна",
      "pt": "inventwo Design Widgets",
      "nl": "inventwo Design Widgets",
      "fr": "inventwo Design Widgets",
      "it": "inventwo Design Widgets",
      "es": "inventwo Widgets de diseño",
      "pl": "wynalazki dwóch widżetów projektowych",
      "uk": "винайти два дизайнерські віджети",
      "zh-cn": "inventwo设计小部件"
    },
    "desc": {
      "en": "inventwo Design widgets for ioBroker.vis",
      "de": "inventwo Design Widgets für ioBroker.vis",
      "ru": "Изобретены виджеты дизайна для ioBroker.vis",
      "pt": "widgets de Design do inventwo para ioBroker.vis",
      "nl": "inventwo Ontwerpwidgets voor ioBroker.vis",
      "fr": "widgets Inventwo Design pour ioBroker.vis",
      "it": "inventwo Widget di design per ioBroker.vis",
      "es": "inventwo Widgets de diseño para ioBroker.vis",
      "pl": "wynalazki Widżety projektowe dla ioBroker.vis",
      "uk": "винайти два дизайнерських віджети для ioBroker.vis",
      "zh-cn": "ioBroker.vis的inventwo设计小部件"
    },
    "authors": [
      "jkvarel <jkvarel@inventwo.com>",
      "skvarel <skvarel@inventwo.com>"
    ],
    "keywords": [
      "home automation",
      "inventwo",
      "vis"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free",
      "link": "https://github.com/inventwo/ioBroker.vis.inventwo/blob/master/README.md"
    },
    "platform": "Javascript/Node.js",
    "icon": "inventwo.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.vis-inventwo/master/admin/inventwo.png",
    "readme": "https://github.com/inventwo/ioBroker.vis-inventwo/blob/master/README.md",
    "loglevel": "info",
    "restartAdapters": [
      "vis",
      "web"
    ],
    "adminTab": {
      "name": {
        "en": "inventwo VIS",
        "de": "inventwo VIS"
      },
      "link": "/adapter/vis-inventwo/index_m.html?%instance%",
      "fa-icon": "dashboard"
    },
    "singleton": true,
    "noConfig": false,
    "messagebox": true,
    "mode": "once",
    "type": "visualization-widgets",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize",
      "tab": "html"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ],
    "tier": 1
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
